import { useState } from 'react';
import { useNavigate } from 'react-router-dom';
import Header from "../../components/common/Header/Header";
import LeftSidebar from "../../components/LeftSidebar";
import Tag from "../../components/Tag";

const mockAnswers = [
  {
    id: 1,
    title: '성장 과정과 가치관',
    content: '저는 어릴 때부터 주변 사람들의 이야기에 귀 기울이며 공감하는 것을 중요하게 생각했습니다. 중학교 시절 학급 친구가 개인적인 어려움으로 힘들어하는 모습을 보고 먼저 다가가 이야기를 들어주고 함께 고민을 나누며 큰 힘이 되어주었습니다. 그 경험을 통해 타인의 입장에서 생각하고 도움을 주는 것이 얼마나 의미 있는 일인지 깨달았습니다. 이러한 경험은 저의 가치관 형성에 큰 영향을 주었고, \'사람 중심의 가치\'를 가장 중요하게 여기게 되었습니다. 이후 다양한 봉사활동과 팀 프로젝트에 참여하며 협력과 배려의 자세를 키웠습니다. 특히 고등학교 때 진행한 지역 아동 학습 멘토링 활동에서는 아이들의 작은 성장이 큰 보람으로 다가왔고, 제가 가진 역량이 누군가에게 긍정적인 영향을 줄 수 있다는 확신을 갖게 되었습니다. 앞으로도 저는 사람을 존중하고 함께 성장하는 가치를 바탕으로 사회에 긍정적인 변화를 만들어가는 사람이 되고자 합니다.',
    charCount: 786,
  },
  { id: 2, title: '지원 동기', content: '지원 동기 내용이 들어갈 자리입니다.', charCount: 0 },
  { id: 3, title: '학업 계획', content: '학업 계획 내용이 들어갈 자리입니다.', charCount: 0 },
  { id: 4, title: '자기주도적 학습 경험', content: '학습 경험 내용이 들어갈 자리입니다.', charCount: 0 },
  { id: 5, title: '장래 계획과 포부', content: '장래 계획 내용이 들어갈 자리입니다.', charCount: 0 },
];

const mockInterviews = [
  {
    id: 1,
    title: '본인의 가장 큰 장점은 무엇인가요?',
    intent: '지원자의 핵심 역량과 강점을 파악하기 위한 질문입니다.',
    tip: '구체적인 경험을 들어 설명하면 신뢰도를 높일 수 있어요.',
    exampleAnswer: '저의 가장 큰 장점은 "지속적으로 배우고 성장하는 능력"입니다. 새로운 환경에 빠르게 적응하고, 모르는 것을 두려워하지 않고 배워나가는 태도가 저를 성장시켜 왔습니다.\n대학 시절, 교내 프로젝트에서 팀의 리더를 맡은 적이 있습니다. 처음에는 경험이 부족해 어려움이 많았지만, 관련 자료를 찾아보고 팀원들과 지속적으로 소통하며 문제를 해결해 나갔습니다.\n그 결과, 프로젝트는 성공적으로 마무리되었고 팀원들과 좋은 관계를 유지할 수 있었습니다.\n이 경험을 통해 저는 도전적인 상황에서도 포기하지 않고 배우며 성장하는 사람이 되었습니다.',
    guideSteps: [
      { step: 'STEP 1', title: '강점 제시', desc: '본인의 핵심 강점을 한 문장으로 먼저 명확히 제시하세요.' },
      { step: 'STEP 2', title: '경험 설명', desc: '해당 강점을 보여주는 구체적인 경험을 상황 → 행동 → 결과 순서로 설명하세요.' },
      { step: 'STEP 3', title: '성장 및 활용', desc: '그 경험을 통해 무엇을 배우고 성장했는지, 앞으로 어떻게 활용할 것인지 마무리하세요.' }
    ]
  },
  {
    id: 2,
    title: '지원하게 된 동기는 무엇인가요?',
    intent: '장학금의 취지와 지원자의 목표가 얼마나 부합하는지 확인합니다.',
    tip: '솔직하고 구체적인 동기를 본인의 비전과 연결지어 보세요.',
    exampleAnswer: '지원 동기 예시 답변이 들어갈 자리입니다.',
    guideSteps: []
  },
];

{/* 지원서 */}
function ApplicationAccordionItem({ item }: { item: typeof mockAnswers[0] }) {
  const [isOpen, setIsOpen] = useState(false);

  return (
    <div className={"border-[#E6E7E8] border rounded-[8px] bg-white"}>
      <button
        onClick={() => setIsOpen(!isOpen)}
        className="w-full flex items-center justify-between px-[24px] py-[20px]"
      >
        <div className="flex items-center gap-[8px]">
          <div className="flex justify-center items-center w-[24px] h-[24px] rounded-full bg-[#7962ED] text-white text-[14px] font-[500] mt-[2px]">
            {item.id}
          </div>
          <span className={"text-[20px] font-[600] text-[#10131A]"}>
            {item.title}
          </span>
        </div>
        <svg
          className={`w-[24px] h-[24px] shrink-0 transform transition-transform ${isOpen ? 'rotate-180' : ''}`}
          viewBox="0 0 24 24"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <path d="M6 9L12 15L18 9" stroke={isOpen ? '#181C25' : '#9DA1AC'} strokeWidth="2" strokeLinecap="round" strokeLinejoin="round" />
        </svg>
      </button>
      
      {isOpen && (
        <div className="mr-[37px] ml-[23px] mb-[14px] pt-[8px] bg-[#F9FAFC] rounded-[8px]">
          <p className="text-[#555964] text-[14px] font-[500] pt-[15px] pl-[23px] pr-[25px]">
            {item.content}
          </p>
          <div className="pb-[14px] mt-[28px] mb-[14px] mr-[25px] text-right text-[#555964] text-[14px] font-[500]">
            ({item.charCount}자)
          </div>
        </div>
      )}
    </div>
  );
}

{/* 면접 예상 질문 */}
function InterviewAccordionItem({ item }: { item: typeof mockInterviews[0] }) {
  const [isOpen, setIsOpen] = useState(false);

  return (
    <div className={"border-[#D2D4DA] rounded-[8px] border gap-[20px]"}>
      <div
        onClick={() => setIsOpen(!isOpen)}
        className="w-full pl-[24px] pr-[28px] py-[20px] flex items-start"
      >
        <div className="flex flex-col gap-[12px] w-full">
          <div className="flex gap-[8px]">
            <div className="flex justify-center items-center w-[24px] h-[24px] rounded-full bg-[#7962ED] text-white text-[14px] font-[500] shrink-0 mt-[2px]">
            {item.id}
          </div>
          <div className="gap-[16px]">
              <span className={`flex text-[18px] font-[700] ${isOpen ? 'text-[#181C25]' : 'text-[#373B46]'}`}>
                {item.title}
              </span>
            </div>
          </div>
          <div className="flex flex-col items-start gap-[8px]">
              <div className="flex items-start gap-[12px]">
                <Tag variant="pale">질문의도</Tag>
                <span className="text-[#555964] text-[16px] font-[500]">
                  {item.intent}
                </span>
              </div>
              <div className="flex items-start gap-[12px]">
                <Tag variant="pale">답변 Tip</Tag>
                <span className="text-[#555964] text-[16px] font-[500]">
                  {item.tip}
                </span>
              </div>
            </div>
        </div>
        <svg
          className={`w-[24px] h-[24px] shrink-0 transform transition-transform mt-[2px] ${isOpen ? 'rotate-180' : ''}`}
          viewBox="0 0 24 24"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <path d="M6 9L12 15L18 9" stroke={isOpen ? '#181C25' : '#9DA1AC'} strokeWidth="2" strokeLinecap="round" strokeLinejoin="round" />
        </svg>
      </div>

      {isOpen && (
        <div className="px-[20px]">
          <div className="bg-[#7962ED0D] border border-[#7962ED] rounded-[8px] p-[20px] mb-[22px] flex flex-col">
            <div>
              <div className="flex items-center gap-[8px] mb-[6px]">
                <svg width="15" height="18" viewBox="0 0 15 18" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path d="M8.30469 17.8203C8.20573 17.8203 8.11979 17.7865 8.04688 17.7188C7.97917 17.6562 7.9375 17.5703 7.92188 17.4609C7.80208 16.6068 7.67188 15.888 7.53125 15.3047C7.39583 14.7266 7.21354 14.25 6.98438 13.875C6.75521 13.5 6.45312 13.2005 6.07812 12.9766C5.70833 12.7526 5.23438 12.5729 4.65625 12.4375C4.08333 12.2969 3.375 12.1719 2.53125 12.0625C2.41667 12.0521 2.32552 12.0104 2.25781 11.9375C2.1901 11.8646 2.15625 11.776 2.15625 11.6719C2.15625 11.5729 2.1901 11.487 2.25781 11.4141C2.32552 11.3411 2.41667 11.2995 2.53125 11.2891C3.375 11.1953 4.08594 11.0833 4.66406 10.9531C5.24219 10.8229 5.71875 10.6432 6.09375 10.4141C6.46875 10.1849 6.77083 9.88021 7 9.5C7.22917 9.11979 7.41146 8.63802 7.54688 8.05469C7.6875 7.46615 7.8125 6.74219 7.92188 5.88281C7.9375 5.77865 7.97917 5.69531 8.04688 5.63281C8.11979 5.5651 8.20573 5.53125 8.30469 5.53125C8.40885 5.53125 8.49479 5.5651 8.5625 5.63281C8.63021 5.69531 8.67448 5.77865 8.69531 5.88281C8.80469 6.74219 8.92708 7.46615 9.0625 8.05469C9.20312 8.63802 9.38542 9.11979 9.60938 9.5C9.83854 9.88021 10.1406 10.1849 10.5156 10.4141C10.8906 10.6432 11.3672 10.8229 11.9453 10.9531C12.5234 11.0833 13.237 11.1953 14.0859 11.2891C14.1953 11.2995 14.2839 11.3411 14.3516 11.4141C14.4193 11.487 14.4531 11.5729 14.4531 11.6719C14.4531 11.776 14.4193 11.8646 14.3516 11.9375C14.2839 12.0104 14.1953 12.0521 14.0859 12.0625C13.237 12.1562 12.5234 12.2682 11.9453 12.3984C11.3672 12.5286 10.8906 12.7083 10.5156 12.9375C10.1406 13.1615 9.83854 13.4635 9.60938 13.8438C9.38542 14.224 9.20312 14.7083 9.0625 15.2969C8.92708 15.8854 8.80469 16.6068 8.69531 17.4609C8.67448 17.5703 8.63021 17.6562 8.5625 17.7188C8.49479 17.7865 8.40885 17.8203 8.30469 17.8203ZM3.00781 9.17969C2.85156 9.17969 2.76302 9.09375 2.74219 8.92188C2.67969 8.40104 2.61198 7.99219 2.53906 7.69531C2.47135 7.39844 2.35938 7.17708 2.20312 7.03125C2.05208 6.88021 1.82292 6.76562 1.51562 6.6875C1.21354 6.60938 0.796875 6.52604 0.265625 6.4375C0.0885417 6.41146 0 6.32292 0 6.17188C0 6.02604 0.078125 5.9401 0.234375 5.91406C0.770833 5.8099 1.19271 5.71875 1.5 5.64062C1.80729 5.55729 2.03906 5.44271 2.19531 5.29688C2.35156 5.15104 2.46615 4.9349 2.53906 4.64844C2.61198 4.35677 2.67969 3.95052 2.74219 3.42969C2.76302 3.25781 2.85156 3.17188 3.00781 3.17188C3.16406 3.17188 3.2526 3.25521 3.27344 3.42188C3.34115 3.94792 3.40885 4.36198 3.47656 4.66406C3.54948 4.96615 3.66146 5.19531 3.8125 5.35156C3.96875 5.5026 4.20052 5.61458 4.50781 5.6875C4.8151 5.76042 5.23958 5.83594 5.78125 5.91406C5.84896 5.91927 5.90365 5.94531 5.94531 5.99219C5.99219 6.03906 6.01562 6.09896 6.01562 6.17188C6.01562 6.31771 5.9375 6.40625 5.78125 6.4375C5.23958 6.54167 4.8151 6.63542 4.50781 6.71875C4.20573 6.79688 3.97656 6.91146 3.82031 7.0625C3.66927 7.20833 3.55729 7.42708 3.48438 7.71875C3.41146 8.01042 3.34115 8.41667 3.27344 8.9375C3.26302 9.00521 3.23438 9.0625 3.1875 9.10938C3.14062 9.15625 3.08073 9.17969 3.00781 9.17969ZM6.78906 3.80469C6.6901 3.80469 6.63281 3.7526 6.61719 3.64844C6.55469 3.33073 6.5 3.08073 6.45312 2.89844C6.41146 2.71615 6.34375 2.57812 6.25 2.48438C6.16146 2.38542 6.02344 2.30729 5.83594 2.25C5.64844 2.19271 5.38542 2.13542 5.04688 2.07812C4.94271 2.05729 4.89062 1.9974 4.89062 1.89844C4.89062 1.80469 4.94271 1.7474 5.04688 1.72656C5.38542 1.66406 5.64844 1.60677 5.83594 1.55469C6.02344 1.4974 6.16146 1.42188 6.25 1.32812C6.34375 1.22917 6.41146 1.08854 6.45312 0.90625C6.5 0.723958 6.55469 0.473958 6.61719 0.15625C6.63281 0.0520833 6.6901 0 6.78906 0C6.88281 0 6.9401 0.0520833 6.96094 0.15625C7.01823 0.473958 7.07031 0.723958 7.11719 0.90625C7.16406 1.08854 7.23177 1.22917 7.32031 1.32812C7.41406 1.42188 7.55469 1.4974 7.74219 1.55469C7.92969 1.60677 8.19271 1.66406 8.53125 1.72656C8.63542 1.7474 8.6875 1.80469 8.6875 1.89844C8.6875 1.9974 8.63542 2.05729 8.53125 2.07812C8.19271 2.13542 7.92969 2.19271 7.74219 2.25C7.55469 2.30729 7.41406 2.38542 7.32031 2.48438C7.23177 2.57812 7.16406 2.71615 7.11719 2.89844C7.07031 3.08073 7.01823 3.33073 6.96094 3.64844C6.9401 3.7526 6.88281 3.80469 6.78906 3.80469Z" fill="#7962ED"/>
                </svg>
                <span className="text-[#10131A] text-[16px] font-[700]">예시답변</span>
              </div>
              <p className="ml-[22px] mb-[16px] text-[#555964] text-[12px] font-[500]">
                {item.exampleAnswer}
              </p>
              <div className="w-full h-[1px] bg-[#D2D4DA]"></div>
            </div>

            {item.guideSteps && item.guideSteps.length > 0 && (
              <div>
                <div className="flex items-center gap-[7px] mt-[12px] mb-[12px]">
                  <svg width="17" height="17" viewBox="0 0 17 17" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M8.07031 16.1406C6.95573 16.1406 5.91146 15.9297 4.9375 15.5078C3.96354 15.0911 3.10677 14.513 2.36719 13.7734C1.6276 13.0391 1.04688 12.1849 0.625 11.2109C0.208333 10.2318 0 9.1849 0 8.07031C0 6.95573 0.208333 5.91146 0.625 4.9375C1.04688 3.95833 1.6276 3.09896 2.36719 2.35938C3.10677 1.61979 3.96354 1.04167 4.9375 0.625C5.91146 0.208333 6.95573 0 8.07031 0C9.1849 0 10.2292 0.208333 11.2031 0.625C12.1823 1.04167 13.0417 1.61979 13.7812 2.35938C14.5208 3.09896 15.099 3.95833 15.5156 4.9375C15.9375 5.91146 16.1484 6.95573 16.1484 8.07031C16.1484 9.1849 15.9375 10.2318 15.5156 11.2109C15.099 12.1849 14.5208 13.0391 13.7812 13.7734C13.0417 14.513 12.1823 15.0911 11.2031 15.5078C10.2292 15.9297 9.1849 16.1406 8.07031 16.1406ZM8.07031 14.5469C8.96615 14.5469 9.80469 14.3776 10.5859 14.0391C11.3672 13.7057 12.0547 13.2422 12.6484 12.6484C13.2474 12.0547 13.7135 11.3672 14.0469 10.5859C14.3802 9.80469 14.5469 8.96615 14.5469 8.07031C14.5469 7.17448 14.3802 6.33594 14.0469 5.55469C13.7135 4.76823 13.2474 4.08073 12.6484 3.49219C12.0547 2.89844 11.3672 2.4349 10.5859 2.10156C9.80469 1.76302 8.96615 1.59375 8.07031 1.59375C7.17969 1.59375 6.34115 1.76302 5.55469 2.10156C4.77344 2.4349 4.08594 2.89844 3.49219 3.49219C2.89844 4.08073 2.43229 4.76823 2.09375 5.55469C1.76042 6.33594 1.59375 7.17448 1.59375 8.07031C1.59375 8.96615 1.76042 9.80469 2.09375 10.5859C2.43229 11.3672 2.89844 12.0547 3.49219 12.6484C4.08594 13.2422 4.77344 13.7057 5.55469 14.0391C6.34115 14.3776 7.17969 14.5469 8.07031 14.5469ZM7.89844 9.625C7.40365 9.625 7.15625 9.40365 7.15625 8.96094C7.15625 8.94531 7.15625 8.92969 7.15625 8.91406C7.15625 8.89844 7.15625 8.88542 7.15625 8.875C7.15625 8.51562 7.24479 8.22396 7.42188 8C7.60417 7.77604 7.83594 7.56771 8.11719 7.375C8.45052 7.14583 8.69792 6.95052 8.85938 6.78906C9.02604 6.6276 9.10938 6.42448 9.10938 6.17969C9.10938 5.91406 9.01042 5.69792 8.8125 5.53125C8.61979 5.35938 8.36458 5.27344 8.04688 5.27344C7.89062 5.27344 7.74479 5.29948 7.60938 5.35156C7.47917 5.40365 7.35677 5.47917 7.24219 5.57812C7.13281 5.67188 7.03385 5.78906 6.94531 5.92969L6.82031 6.09375C6.7474 6.19271 6.65885 6.27083 6.55469 6.32812C6.45573 6.38542 6.33594 6.41406 6.19531 6.41406C6.03385 6.41406 5.89062 6.35938 5.76562 6.25C5.64062 6.14062 5.57812 5.99219 5.57812 5.80469C5.57812 5.73177 5.58333 5.66406 5.59375 5.60156C5.60938 5.53385 5.63021 5.46615 5.65625 5.39844C5.77604 5.03385 6.05208 4.71875 6.48438 4.45312C6.92188 4.1875 7.47656 4.05469 8.14844 4.05469C8.60677 4.05469 9.02865 4.13542 9.41406 4.29688C9.80469 4.45833 10.1172 4.6901 10.3516 4.99219C10.5859 5.29427 10.7031 5.66146 10.7031 6.09375C10.7031 6.55208 10.5859 6.91406 10.3516 7.17969C10.1224 7.44531 9.81771 7.70573 9.4375 7.96094C9.17708 8.1276 8.97917 8.28646 8.84375 8.4375C8.70833 8.58854 8.63542 8.76562 8.625 8.96875C8.625 8.97917 8.625 8.99479 8.625 9.01562C8.625 9.03125 8.6224 9.04688 8.61719 9.0625C8.60677 9.21875 8.53646 9.35156 8.40625 9.46094C8.28125 9.57031 8.11198 9.625 7.89844 9.625ZM7.88281 12.0234C7.63281 12.0234 7.41667 11.9427 7.23438 11.7812C7.05729 11.6146 6.96875 11.4089 6.96875 11.1641C6.96875 10.9193 7.05729 10.7161 7.23438 10.5547C7.41146 10.388 7.6276 10.3047 7.88281 10.3047C8.13802 10.3047 8.35417 10.3854 8.53125 10.5469C8.70833 10.7083 8.79688 10.9141 8.79688 11.1641C8.79688 11.4141 8.70833 11.6198 8.53125 11.7812C8.35417 11.9427 8.13802 12.0234 7.88281 12.0234Z" fill="#7962ED"/>
                  </svg>
                  <span className="text-[#10131A] text-[16px] font-[700]">구성 가이드</span>
                </div>
                <div className="flex flex-col gap-[4px]">
                  {item.guideSteps.map((step, idx) => (
                    <div key={idx} className="flex items-start">
                      <div className="flex items-start gap-[12px]">
                        <div>
                          <Tag variant="primary">{step.step}</Tag>
                          {idx < item.guideSteps!.length - 1 && (
                            <svg 
                              className="mx-[27px] mt-[8px] mb-[7px]" 
                              width="8" height="15" viewBox="0 0 8 15" fill="none" xmlns="http://www.w3.org/2000/svg"
                            >
                              <path d="M4.18359 0.5C4.18359 0.223858 3.95974 1.20708e-08 3.68359 0C3.40745 -1.20708e-08 3.18359 0.223858 3.18359 0.5L3.68359 0.5L4.18359 0.5ZM3.33004 14.8536C3.5253 15.0488 3.84188 15.0488 4.03715 14.8536L7.21913 11.6716C7.41439 11.4763 7.41439 11.1597 7.21913 10.9645C7.02387 10.7692 6.70728 10.7692 6.51202 10.9645L3.68359 13.7929L0.855166 10.9645C0.659904 10.7692 0.343322 10.7692 0.148059 10.9645C-0.0472028 11.1597 -0.0472028 11.4763 0.148059 11.6716L3.33004 14.8536ZM3.68359 0.5L3.18359 0.5L3.18359 14.5L3.68359 14.5L4.18359 14.5L4.18359 0.5L3.68359 0.5Z" fill="#7962ED"/>
                            </svg>
                          )}
                        </div>
                        <div className="flex flex-col gap-[2px]">
                          <span className="text-[#10131A] text-[16px] font-[600]">{step.title}</span>
                          <span className="text-[#555964] text-[12px] font-[500]">{step.desc}</span>
                        </div>
                      </div>
                    </div>
                  ))}
                </div>
              </div>
            )}
            
          </div>
        </div>
      )}
      
    </div>
  );
}

export default function Complete() {
  const navigate = useNavigate();
  const [activeTab, setActiveTab] = useState<'application' | 'interview'>('application');

  return (
    <div className="w-[1440px] min-h-screen">
      <header className="mb-[16px]">
        <Header 
          isSearchMode={true} 
          onBack={() => navigate(-1)} 
        />
      </header>

      <div className="flex flex-1 relative">
        <aside className="relative ml-[64px] h-full">
          <LeftSidebar />
        </aside>

        <main className="flex-1 flex flex-col ml-[32px]">
          {/* 상단 타이틀 */}
          <div className="flex justify-between items-start">
                <div className="flex flex-col gap-[12px]">
                    <div className="flex items-center gap-[8px]">
                        <h1 className="text-[#181C25] text-[36px] font-[700]">서울미래예체능장학금</h1>
                        <Tag variant="primary">작성 완료</Tag>
                    </div>
                    <div className="flex items-center text-[#555964] font-[600] text-[16px] gap-[8px] flex">
                        <span>신청기간</span><span>•</span><span>2026.05.01 - 2026.05.31</span>
                    </div>
                </div>
            </div>

          {/* 탭 영역 */}
          <div className="flex w-full py-[4px] gap-[4px] px-[8px] h-[48px] mt-[19.5px] bg-[#F3F4F6] rounded-[100px]">
            <button
              onClick={() => setActiveTab('application')}
              className={`flex-1 flex justify-center items-center px-[6px] py-[3px] rounded-[20px] text-[13px] font-['SF Pro'] font-[590] transition-colors ${
                activeTab === 'application'
                  ? 'bg-[#7962ED] text-[#F3F4F6]'
                  : 'text-[#272B36] font-[510]'
              }`}
            >
              내가 작성한 지원서
            </button>
            <button
              onClick={() => setActiveTab('interview')}
              className={`flex-1 flex justify-center items-center px-[6px] py-[3px] rounded-[20px] text-[13px] font-['SF Pro'] font-[590] transition-colors ${
                activeTab === 'interview'
                  ? 'bg-[#7962ED] text-[#F3F4F6]'
                  : 'text-[#272B36] font-[510]'
              }`}
            >
              면접 예상 질문
            </button>
          </div>

          {/* 리스트 */}
          <div className="flex flex-col gap-[12px] mt-[16px]">
            {activeTab === 'application' 
              ? mockAnswers.map((item) => (
                  <ApplicationAccordionItem key={item.id} item={item} />
                ))
              : mockInterviews.map((item) => (
                  <InterviewAccordionItem key={item.id} item={item} />
                ))
            }
          </div>
        </main>
      </div>
    </div>
  );
}